[1,0,0,[["cc.TextAsset",["_name","text"],1]],[[0,0,1,3]],[[0,"2","我们将通过《游戏隐私政策》向您进一步细化说明您在使用本游戏时我们收集、使用、存储和共享个人信息的情况，以及您所享有的相关权利等事宜。\r\n\r\n您可以通过阅读完整版《游戏隐私政策》，了解个人信息类型与用途的对应关系等更加详尽的个人信息处理规则。我们将恪守权责一致原则、目的明确原则、选择同意原则、最小必要原则、确保安全原则、主体参与原则、公开透明原则等原则，持续根据最新法律法规并参照行业最佳实践为您的个人信息提供充分和安全的保障。\r\n\r\n本协议的订立、履行、解释及争议的解决均适用中华人民共和国法律并排除其他一切冲突法的适用。如双方就本协议的内容或其执行发生任何争议（包括但不限于合同或者其他财产性权益纠纷），双方应友好协商解决；协商不成时，双方同意交由深圳市网络科技有限公司所在地人民法院管辖并处理。\r\n\r\n请您务必仔细阅读并透彻理解本政策，特别是以黑色加粗、下划线方式提示您注意的条款，您应重点阅读并在确认充分理解及同意后再开始使用。如果您继续使用我们的服务，即表示您同意我们按照本政策收集、使用、储存和披露您的相关信息。如果您是未成年人，尤其是不满十四周岁的儿童，您应确保在监护人的陪同下阅读本政策，且在征得监护人的明示同意后方可使用我们的产品。\r\n\r\n一、我们如何收集和使用个人信息\r\n\r\n二、我们如何使用COOKIES或同类技术\r\n\r\n三、我们可能分享、转让或披露的个人信息\r\n\r\n四、我们如何储存和保护个人信息\r\n\r\n五、如何管理您的个人信息\r\n\r\n六、第三方服务\r\n\r\n七、年龄限制\r\n\r\n八、通知和修订\r\n\r\n九、如何联系我们\r\n\r\n一、 我们如何收集和使用个人信息\r\n\r\n在您使用游戏服务的过程中，游戏会按照如下方式收集您在使用服务时主动提供的或因为使用服务而产生的信息，用以向您提供、优化我们的服务以及保障您的账户安全：\r\n\r\n1.1 当您注册或使用游戏服务时，我们会收集您的网络身份标识信息及个人常用设备信息，用于标记您为游戏的用户。\r\n\r\n1.2 为满足相关法律法规政策及相关主管部门的要求，游戏用户需进行实名认证以继续使用和享受游戏。 我们会在获得您同意或您主动提供的情况下收集您的实名身份信息，您可以根据认证要求提供相应的身份信息（身份证、护照、户口本及其他身份证件信息）以完成实名认证以增强账号安全保护。该信息属于敏感信息，拒绝提供实名身份信息可能会导致您无法登陆游戏或在使用游戏过程中受到相应限制。\r\n\r\n1.3 为保障您正常使用我们的服务，维护游戏基础功能的正常运行，优化游戏产品性能，提升您的游戏体验并保障您的账号安全，我们会收集您的设备ID、设备名称、设备类型和版本、系统版本、IP地址和端口号、MAC地址、应用ID、网络类型等信息。\r\n为保障您正常使用我们的在线客服服务， 我们需要获取您的登录手机号、咨询时您所上传的图片、文字， 用于实现在线客服咨询功能。\r\n\r\n1.4 当您使用游戏服务时， 我们会收集您的游戏日志信息，如登录日志、物品日志、游戏内行为信息等，以便您能够在客户端查看您的游戏历史记录，同时用于游戏运营统计分析、客服投诉处理及其他游戏安全分析，并为提升您的游戏体验，我们可能把前述信息同步至该游戏后续版本或您正在使用的我们提供的其他产品中。\r\n\r\n1.5 如您使用OPPO、VIVO、小米、华为等品牌手机，游戏接入的上述手机厂商SDK需要收集手机唯一标识信息（如IMEI），并可能会收集您的手机型号、系统类型、系统版本、设备屏幕尺寸、短信等参数用于实现游戏产品和活动等信息的推送或验证，具体情况请参见SDK运营方的隐私政策或相关声明。\r\n\r\n1.6 当您使用游戏产品的消费功能时，我们会收集您的 充值记录、消费记录等信息，以便您查询您的交易记录，同时尽最大程度保护您的虚拟物品安全。 充值记录、消费记录属于敏感信息，收集上述信息为实现游戏产品的消费功能所必须，否则将无法完成交易。\r\n\r\n1.7 为保障您的游戏账号安全，营造公平、健康及安全的游戏环境，我们会收集您的 游戏识别信息、硬件及操作系统信息、进程及游戏崩溃记录等信息，以用于打击破坏游戏公平环境或干扰、破坏游戏服务正常进行的行为（如用于检测盗版、扫描外挂、防止作弊等）。\r\n\r\n1.10 根据相关法律法规及国家标准，以下情形中，我们可能会收集、使用您的相关个人信息无需征求您的授权同意：\r\n1） 与国家安全、国防安全等国家利益直接相关的；与公共安全、公共卫生、公共知情等重大公共利益直接相关的；\r\n2） 与犯罪侦查、起诉、审判和判决执行等直接相关的；\r\n3） 出于维护您或其他个人的生命、财产、声誉等重大合法权益但又很难得到本人同意的；\r\n4） 所收集的个人信息是您自行向社会公众公开的；\r\n5） 从合法公开披露的信息中收集个人信息的，如合法的新闻报道、政府信息公开等渠道；\r\n6） 根据您要求签订和履行合同所必需的；\r\n7） 用于维护所提供的产品或服务的安全稳定运行所必需的，如发现、处置产品或服务的故障；\r\n8） 为开展合法的新闻报道所必需的；\r\n9） 出于公共利益开展统计或学术研究所必要，且其对外提供学术研究或描述的结果时，对结果中所包含的个人信息进行去标识化处理的；\r\n10） 法律法规规定的其他情形。\r\n\r\n1.11 请您理解，我们向您提供的功能和服务是不断更新和发展的，如果某一功能或服务未在前述说明中且收集了您的信息，我们会通过页面提示、交互流程、网站公告等方式另行向您说明信息收集的内容、范围和目的，以征得您的同意。\r\n\r\n二、我们如何使用COOKIES或同类技术\r\n\r\n我们或我们的第三方合作伙伴可能通过COOKIES或同类技术获取和使用您的信息，并将该等信息储存为日志信息。\r\n\r\n通过使用COOKIES，我们向用户提供简单易行并富个性化的网络体验。一个COOKIES是少量的数据，它们从一个网络服务器送至您的浏览器并存在计算机硬盘上。我们使用COOKIES是为了让其用户可以受益。比如，为使得游戏的登录过程更快捷，您可以选择把用户名存在一个COOKIES中。这样下次当您要登录游戏的服务时能更加方便快捷。COOKIES能帮助我们确定您连接的页面和内容，您在游戏特定服务上花费的时间和您所选择的游戏服务。\r\n\r\nCOOKIES使得我们能更好、更快地为您服务，并且使您在游戏服务上的经历更富个性化。然而，您应该能够控制COOKIES是否以及怎样被您的浏览器接受。请查阅您的浏览器附带的文件以获得更多这方面的信息。\r\n\r\n我们和第三方合作伙伴可能通过COOKIES或同类技术收集和使用您的信息，并将该等信息储存。\r\n\r\n\r\n三、我们可能分享、转让或披露的个人信息\r\n\r\n（一）分享\r\n除以下情形外，未经您同意，我们不会与游戏之外的任何第三方分享您的个人信息：\r\n1、向您提供我们的服务。我们可能向合作伙伴及其他第三方分享您的信息，以实现我们产品与/或服务的功能，让您正常使用您需要的服务，如：提供支付服务的支付机构、提供数据服务（包括网络广告监测、数据统计、数据分析）的合作伙伴、第三方物流公司和其他服务提供商；\r\n2、与关联方的必要分享。为便于我们基于统一的账号体系向您提供一致化服务以及便于您进行统一管理、保障系统和账号安全等，您的个人信息可能会在我们和我们的关联方之间进行必要共享；\r\n3、实现本政策第一条“我们如何收集和使用个人信息”部分所述目的；\r\n4、履行我们在本政策或我们与您达成的其他协议中的义务和行使我们的权利；\r\n5、向委托我们进行推广的合作伙伴等第三方共享，目的是为了使该等委托方了解推广的覆盖面和有效性。比如我们可以告知该委托方有多少人看了他们的推广信息或在看到这些信息后购买了委托方的商品，或者向他们提供不能识别个人身份的统计信息，帮助他们了解其受众或顾客；\r\n6、在法律法规允许的范围内，为了遵守法律、维护我们及我们的关联方或合作伙伴、您或其他游戏用户或社会公众利益、财产或安全免遭损害，比如为防止欺诈等违法活动和减少信用风险，我们可能与其他公司和组织交换信息。不过，这并不包括违反本政策中所作的承诺而为获利目的出售、出租、共享或以其它方式披露的信息；\r\n7、应您合法需求或经您的授权同意；\r\n8、应您的监护人合法要求而提供您的信息；\r\n9、根据与您签署的单项服务协议（包括在线签署的电子协议以及相应的平台规则）或其他的法律文件约定所提供；\r\n10、基于学术研究而提供；\r\n11、基于符合法律法规的社会公共利益而提供。\r\n我们仅会出于合法、正当、必要、特定、明确的目的共享您的个人信息。对我们与之共享个人信息的公司、组织和个人，我们会与其签署严格的保密协定，要求他们按照我们的说明、本政策以及其他任何相关的保密和安全措施来处理信息。\r\n\r\n（二）转让\r\n1、随着我们业务的持续发展，我们有可能进行合并、收购、资产转让或类似的交易，而您的信息有可能作为此类交易的一部分而被转移。我们会要求新的持有您个人信息的公司、组织继续受本政策的约束，否则，我们将要求该公司、组织重新向您征求授权同意。\r\n2、在获得您的明确同意后，我们会向其他方转让您的个人信息。\r\n\r\n（三）披露\r\n我们仅会在以下情况下，且采取符合业界标准的安全防护措施的前提下，才会披露您的个人信息：\r\n1、根据您的需求，在您明确同意的披露方式下披露您所指定的信息；\r\n2、根据法律、法规的要求、强制性的行政执法或司法要求所必须提供您信息的情况下，我们可能会依据所要求的信息类型和披露方式披露您的信息。在符合法律法规的前提下，当我们收到上述披露信息的请求时，我们会要求接收方必须出具与之相应的法律文件，如传票或调查函。我们坚信，对于要求我们提供的信息，应该在法律允许的范围内尽可能保持透明。我们对所有的请求都进行了慎重的审查，以确保其具备合法依据，且仅限于执法部门因特定调查目的且有合法权利获取的数据。\r\n\r\n（四）分享、转让、披露信息时事先征得授权同意的例外\r\n以下情形中，分享、转让、披露您的信息无需事先征得您的授权同意：\r\n1、与国家安全、国防安全有关的；\r\n2、与公共安全、公共卫生、重大公共利益有关的；\r\n3、与犯罪侦查、起诉、审判和判决执行等司法或行政执法有关的；\r\n4、出于维护您或其他个人的生命、财产等重大合法权益但又很难得到本人同意的；\r\n5、您自行向社会公众公开的信息；\r\n6、从合法公开披露的信息中收集信息的，如合法的新闻报道、政府信息公开等渠道。 根据法律规定，共享、转让、披露经去标识化处理的个人信息，且确保数据接收方无法复原并重新识别信息主体的，不属于个人信息的对外共享、转让及公开披露行为，对此类数据的保存及处理将无需另行向您通知并征得您的同意。\r\n\r\n\r\n五、如何管理您的个人信息\r\n（一）访问、更新和删除\r\n我们鼓励您更新和修改您的个人信息以使其更准确有效。您能通过游戏服务访问您的个人信息，并根据对应信息的管理方式自行完成或要求我们进行修改、补充和删除。我们将采取适当的技术手段或提供提交申请的联系渠道，尽可能保证您可以访问、更新和更正自己的个人信息或使用游戏服务时提供的其他信息。\r\n在访问、更新、更正和删除前述信息时，我们可能会要求您进行身份验证，以保障信息安全。对于通过COOKIES或同类技术收集的您的信息，我们还在本政策第二条“我们如何使用COOKIES或同类技术”部分说明了向您提供的选择机制 如您想查询、修改或删除您的部分信息，请联系游戏客服具体指引进行操作。\r\n除法律法规另有规定，当您更正、删除您的个人信息或申请注销账号时，我们可能不会立即从备份系统中更正或删除相应的信息，但会在备份更新时更正或删除这些信息。\r\n如法律、行政法规规定的保存期限未届满，或者删除个人信息从技术上难以实现的，我们会停止除存储和采取必要的安全保护措施之外的处理。\r\n（二）公开与分享\r\n我们的多项服务可让您不仅与您的社交网络、也与使用该服务的所有用户公开分享您的相关信息，如，您在游戏服务中所上传或发布的信息、您对其他人上传或发布的信息作出的回应，通过电子邮件或在游戏服务中不特定用户可见的公开区域内上传或公布您的信息，以及包括与这些信息有关的位置数据和日志信息。只要您不删除您所公开或共享的信息，有关信息可能一直留存在公众领域；即使您删除共享信息，有关信息仍可能由其他用户或不受我们控制的第三方独立地缓存、复制或储存，或由其他用户或该等第三方在公众领域保存。 如您将信息通过上述渠道公开或共享，由此造成您的信息泄露，我们不承担责任。因此，我们提醒并请您慎重考虑是否通过上述渠道公开或共享您的信息。\r\n（三）注销\r\n在符合游戏单项服务的服务协议约定条件及国家相关法律法规规定的情况下，您的该项游戏服务帐号可能被注销或删除。当帐号注销或被删除后，与该帐号相关的、该单项服务项下的全部服务资料和数据将依照单项服务的服务协议约定删除或处理，但法律法规另有规定的除外。\r\n\r\n六、第三方服务\r\n游戏服务可能链接至第三方提供的社交媒体或其他服务（包括网站或其他服务形式）。包括：\r\n（1）您可利用“分享”键将某些内容分享到第三方服务，或您可利用第三方服务登录游戏服务。这些功能可能会收集您的信息（包括您的日志信息），并可能在您的电脑装置COOKIES，从而正常运行上述功能；\r\n（2）我们通过广告或我们服务的其他方式向您提供链接，使您可以链接至第三方的服务或网站；\r\n（3）其他接入第三方服务的情形。如，为实现本政策中声明的目的，我们可能会接入第三方SDK服务，并将我们依照本政策收集的您的某些个人信息共享给该等第三方，以便提供更好的客户服务和用户体验。\r\n该等第三方社交媒体或其他服务由相关的第三方负责运营。您使用该等第三方的社交媒体服务或其他服务（包括您向该等第三方提供的任何信息），须受第三方自己的服务条款及信息保护声明（而非本政策）约束，您需要仔细阅读其条款。本政策仅适用于我们所收集的个人信息，并不适用于任何第三方提供的服务或第三方的信息使用规则。如您发现这些第三方社交媒体或其他服务存在风险时，建议您终止相关操作以保护您的合法权益。\r\n\r\n七、年龄限制\r\n我们建议： 任何未成年人参加网上活动应事先取得父母或其他监护人（以下简称\"监护人\"）的同意。我们将根据国家相关法律法规的规定保护未成年人的相关信息。\r\n\r\n我们鼓励监护人指导未成年人使用游戏服务。如果您是未满十四周岁的未成年人，您需要通知您的监护人共同阅读并接受我们的《游戏儿童隐私保护指引》 ，并在您使用游戏服务、提交个人信息之前，寻求其同意和指导。\r\n\r\n八、通知和修订\r\n为了给您提供更好的服务，我们可能会根据产品或服务的更新情况及法律法规的相关要求适时修改本政策的条款，该等修改构成本政策的一部分。如该等更新造成您在本政策下权利的实质减少或重大变更，我们将在本政策生效前通过网站公告、推送通知、弹窗提示或其他方式来通知您，您如果不同意该等变更，可以选择停止使用游戏服务；只有在您点击弹窗中的同意按钮后，我们才会按照变更后的隐私权政策收集、使用、共享、保存您的个人信息。\r\n\r\n我们的任何修改都会将您的满意度置于首位。我们鼓励您在每次使用游戏服务时都查阅我们的隐私政策。\r\n\r\n我们可能在必需时（如当我们由于系统维护而暂停某一项服务时）发出与服务有关的公告。您可能无法取消这些与服务有关、性质不属于推广的公告。\r\n\r\n《游戏隐私政策》归属：厦门趣方科技有限公司 \r\n公司地址：厦门市软件园三期诚毅大街359号4层03单元之十五    联系方式 yingqiyu01@163.com"]],0,0,[],[],[]]